x, y = map(int, input().split())
# 차가 어느 범위에 속하는지 알아야 됨
# 1, 2, 4, 6, 9, 12, 16, 20, 25, 30, 36, 42, ...
# + 1 +2 +2 +3  +3  +4  +4  +5  +5  +6  +6, ...

# 키차이=k^2 일 때 걸리는 최소 day=(2k-1)
# k^2 < 키차이 <= (k+1)^2
    # 키차이 == k^2                 -> 2 * k - 1
    # k^2 < 키차이 <= k^2 + k       -> 2 * k
    # k^2 + k < 키차이 <= (k+1)^2   -> 2 * k + 1
    # k^2 + k -> 하나 증가 
d = y - x
k = int(d ** 0.5)

if d == 0:
    print(0)
elif d == k ** 2:
    print(2 * k - 1)
elif k ** 2 < d <= k * (k+1):
    print(2 * k)
else:
    print(2 * k + 1)
